; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=114, out_folder=htg/blocksworld/training, instance_id=94, seed=2118, goal_proportion=0.1

(define (problem blocksworld-94)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 - object)
 (:init 
    (arm-empty)
    (clear b87)
    (on b87 b34)
    (on b34 b106)
    (on-table b106)
    (clear b50)
    (on b50 b38)
    (on b38 b95)
    (on b95 b35)
    (on b35 b49)
    (on b49 b48)
    (on b48 b102)
    (on b102 b99)
    (on-table b99)
    (clear b4)
    (on-table b4)
    (clear b65)
    (on b65 b112)
    (on b112 b7)
    (on b7 b36)
    (on b36 b24)
    (on b24 b114)
    (on b114 b108)
    (on b108 b107)
    (on b107 b83)
    (on b83 b33)
    (on b33 b62)
    (on b62 b12)
    (on b12 b70)
    (on b70 b28)
    (on-table b28)
    (clear b79)
    (on-table b79)
    (clear b16)
    (on b16 b109)
    (on-table b109)
    (clear b96)
    (on b96 b40)
    (on-table b40)
    (clear b18)
    (on b18 b103)
    (on b103 b76)
    (on-table b76)
    (clear b46)
    (on b46 b91)
    (on b91 b90)
    (on-table b90)
    (clear b3)
    (on b3 b60)
    (on-table b60)
    (clear b88)
    (on b88 b30)
    (on b30 b27)
    (on b27 b20)
    (on b20 b42)
    (on b42 b86)
    (on b86 b8)
    (on b8 b69)
    (on-table b69)
    (clear b77)
    (on b77 b104)
    (on b104 b73)
    (on b73 b67)
    (on b67 b10)
    (on b10 b59)
    (on b59 b14)
    (on b14 b5)
    (on b5 b43)
    (on b43 b92)
    (on b92 b110)
    (on b110 b68)
    (on b68 b52)
    (on b52 b53)
    (on b53 b85)
    (on-table b85)
    (clear b81)
    (on b81 b98)
    (on b98 b75)
    (on b75 b11)
    (on b11 b44)
    (on b44 b21)
    (on b21 b13)
    (on b13 b19)
    (on b19 b47)
    (on-table b47)
    (clear b37)
    (on-table b37)
    (clear b31)
    (on b31 b72)
    (on b72 b26)
    (on-table b26)
    (clear b78)
    (on b78 b113)
    (on b113 b9)
    (on-table b9)
    (clear b45)
    (on b45 b15)
    (on-table b15)
    (clear b32)
    (on b32 b100)
    (on b100 b61)
    (on b61 b84)
    (on-table b84)
    (clear b105)
    (on b105 b51)
    (on b51 b22)
    (on b22 b58)
    (on b58 b71)
    (on-table b71)
    (clear b23)
    (on b23 b41)
    (on-table b41)
    (clear b63)
    (on-table b63)
    (clear b64)
    (on-table b64)
    (clear b54)
    (on b54 b39)
    (on b39 b80)
    (on b80 b89)
    (on-table b89)
    (clear b25)
    (on b25 b111)
    (on b111 b6)
    (on b6 b2)
    (on b2 b29)
    (on b29 b57)
    (on b57 b66)
    (on b66 b74)
    (on b74 b94)
    (on-table b94)
    (clear b1)
    (on-table b1)
    (clear b97)
    (on b97 b93)
    (on b93 b17)
    (on-table b17)
    (clear b101)
    (on b101 b82)
    (on b82 b55)
    (on b55 b56)
    (on-table b56))
 (:goal  (and 
    (clear b1)
    (on-table b1)
    (clear b8)
    (on-table b8)
    (clear b6)
    (on b6 b3)
    (on b3 b2)
    (on-table b2)
    (clear b9)
    (on-table b9)
    (clear b11)
    (on b11 b5)
    (on b5 b4)
    (on b4 b7)
    (on b7 b10)
    (on-table b10))))

; plan
1. (unstack b78 b113)
   deleted: (on b78 b113) (clear b78) (arm-empty)
   added: (holding b78) (clear b113)
   goals met: 3 of 16
2. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 3 of 16
3. (unstack b113 b9)
   deleted: (on b113 b9) (clear b113) (arm-empty)
   added: (holding b113) (clear b9)
   goals met: 4 of 16
4. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 4 of 16
5. (unstack b25 b111)
   deleted: (on b25 b111) (clear b25) (arm-empty)
   added: (holding b25) (clear b111)
   goals met: 4 of 16
6. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 16
7. (unstack b111 b6)
   deleted: (on b111 b6) (clear b111) (arm-empty)
   added: (holding b111) (clear b6)
   goals met: 5 of 16
8. (putdown b111)
   deleted: (holding b111)
   added: (clear b111) (arm-empty) (on-table b111)
   goals met: 5 of 16
9. (unstack b6 b2)
   deleted: (on b6 b2) (clear b6) (arm-empty)
   added: (holding b6) (clear b2)
   goals met: 4 of 16
10. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 6 of 16
11. (unstack b2 b29)
   deleted: (on b2 b29) (clear b2) (arm-empty)
   added: (holding b2) (clear b29)
   goals met: 6 of 16
12. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 16
13. (unstack b81 b98)
   deleted: (on b81 b98) (clear b81) (arm-empty)
   added: (holding b81) (clear b98)
   goals met: 7 of 16
14. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 7 of 16
15. (unstack b98 b75)
   deleted: (on b98 b75) (clear b98) (arm-empty)
   added: (holding b98) (clear b75)
   goals met: 7 of 16
16. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 7 of 16
17. (unstack b75 b11)
   deleted: (on b75 b11) (clear b75) (arm-empty)
   added: (holding b75) (clear b11)
   goals met: 8 of 16
18. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 8 of 16
19. (unstack b65 b112)
   deleted: (on b65 b112) (clear b65) (arm-empty)
   added: (holding b65) (clear b112)
   goals met: 8 of 16
20. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 8 of 16
21. (unstack b112 b7)
   deleted: (on b112 b7) (clear b112) (arm-empty)
   added: (holding b112) (clear b7)
   goals met: 8 of 16
22. (putdown b112)
   deleted: (holding b112)
   added: (clear b112) (arm-empty) (on-table b112)
   goals met: 8 of 16
23. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 8 of 16
24. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 9 of 16
25. (unstack b77 b104)
   deleted: (on b77 b104) (clear b77) (arm-empty)
   added: (holding b77) (clear b104)
   goals met: 9 of 16
26. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 9 of 16
27. (unstack b104 b73)
   deleted: (on b104 b73) (clear b104) (arm-empty)
   added: (holding b104) (clear b73)
   goals met: 9 of 16
28. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 9 of 16
29. (unstack b73 b67)
   deleted: (on b73 b67) (clear b73) (arm-empty)
   added: (holding b73) (clear b67)
   goals met: 9 of 16
30. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 9 of 16
31. (unstack b67 b10)
   deleted: (on b67 b10) (clear b67) (arm-empty)
   added: (holding b67) (clear b10)
   goals met: 9 of 16
32. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 9 of 16
33. (unstack b10 b59)
   deleted: (on b10 b59) (clear b10) (arm-empty)
   added: (holding b10) (clear b59)
   goals met: 9 of 16
34. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 10 of 16
35. (unstack b59 b14)
   deleted: (on b59 b14) (clear b59) (arm-empty)
   added: (holding b59) (clear b14)
   goals met: 10 of 16
36. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 10 of 16
37. (unstack b14 b5)
   deleted: (on b14 b5) (clear b14) (arm-empty)
   added: (holding b14) (clear b5)
   goals met: 10 of 16
38. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 10 of 16
39. (unstack b5 b43)
   deleted: (on b5 b43) (clear b5) (arm-empty)
   added: (holding b5) (clear b43)
   goals met: 10 of 16
40. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 11 of 16
41. (unstack b88 b30)
   deleted: (on b88 b30) (clear b88) (arm-empty)
   added: (holding b88) (clear b30)
   goals met: 11 of 16
42. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 11 of 16
43. (unstack b11 b44)
   deleted: (on b11 b44) (clear b11) (arm-empty)
   added: (holding b11) (clear b44)
   goals met: 10 of 16
44. (stack b11 b5)
   deleted: (clear b5) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b5)
   goals met: 12 of 16
45. (unstack b30 b27)
   deleted: (on b30 b27) (clear b30) (arm-empty)
   added: (holding b30) (clear b27)
   goals met: 12 of 16
46. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 12 of 16
47. (unstack b27 b20)
   deleted: (on b27 b20) (clear b27) (arm-empty)
   added: (holding b27) (clear b20)
   goals met: 12 of 16
48. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 12 of 16
49. (unstack b20 b42)
   deleted: (on b20 b42) (clear b20) (arm-empty)
   added: (holding b20) (clear b42)
   goals met: 12 of 16
50. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 12 of 16
51. (unstack b42 b86)
   deleted: (on b42 b86) (clear b42) (arm-empty)
   added: (holding b42) (clear b86)
   goals met: 12 of 16
52. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 12 of 16
53. (unstack b86 b8)
   deleted: (on b86 b8) (clear b86) (arm-empty)
   added: (holding b86) (clear b8)
   goals met: 13 of 16
54. (putdown b86)
   deleted: (holding b86)
   added: (clear b86) (arm-empty) (on-table b86)
   goals met: 13 of 16
55. (unstack b8 b69)
   deleted: (on b8 b69) (clear b8) (arm-empty)
   added: (holding b8) (clear b69)
   goals met: 12 of 16
56. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 14 of 16
57. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 12 of 16
58. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 13 of 16
59. (unstack b3 b60)
   deleted: (on b3 b60) (clear b3) (arm-empty)
   added: (holding b3) (clear b60)
   goals met: 13 of 16
60. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 14 of 16
61. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 13 of 16
62. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 15 of 16
63. (unstack b11 b5)
   deleted: (on b11 b5) (clear b11) (arm-empty)
   added: (holding b11) (clear b5)
   goals met: 13 of 16
64. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 14 of 16
65. (unstack b5 b4)
   deleted: (on b5 b4) (clear b5) (arm-empty)
   added: (holding b5) (clear b4)
   goals met: 13 of 16
66. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 13 of 16
67. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 12 of 16
68. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 12 of 16
69. (unstack b7 b36)
   deleted: (on b7 b36) (clear b7) (arm-empty)
   added: (holding b7) (clear b36)
   goals met: 12 of 16
70. (stack b7 b10)
   deleted: (clear b10) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b10)
   goals met: 13 of 16
71. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 12 of 16
72. (stack b11 b5)
   deleted: (clear b5) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b5)
   goals met: 14 of 16
73. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 14 of 16
74. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 15 of 16
75. (unstack b11 b5)
   deleted: (on b11 b5) (clear b11) (arm-empty)
   added: (holding b11) (clear b5)
   goals met: 13 of 16
76. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 14 of 16
77. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 14 of 16
78. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 15 of 16
79. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 14 of 16
80. (stack b11 b5)
   deleted: (clear b5) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b5)
   goals met: 16 of 16
